ve/controllers/VeController.php

SELECT * FROM `Claim` WHERE `ClaimID`='194948'
---
    public function actionIndex($pg = 'index')
    {
        $ctx[] = [];
        if ($_GET['pg'])
        {
            $pg = $_GET['pg'];
        }
        else
        {
            $pg = 'index';
        }
        if (in_array($pg, ['vehicle']))
        {
            $ClaimID = 194948;
            if (strlen($_GET['c']))
            {
                $ClaimID = $_GET['c'];
            }
            $claim = Claim::find()->where(['ClaimID' => $ClaimID])->one();